app/views/static_pages/index.html.erb


          <li><a href="/events/<%=eve[(i+1)*(-1)].id%>/likes"  data-method = "post"><%= (eve[(i+1)*(-1)].likes.count) == 1 ? 'Like' : 'Likes'%></a><span><%= eve[(i+1)*(-1)].likes.count %> </span></li>
---
SELECT "likes".* FROM "likes" WHERE "likes"."event_id" = $1  [["event_id", 20]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."event_id" = $1  [["event_id", 20]]

<%end%>
          <li><a href="/events/<%= eve[(i+1)*(-1)].id %>/commentaire" title="" class="com">Commentaire </a> <span class="span-last"><%= eve[(i+1)*(-1)].commentaires.all.count %></span></li>
---
SELECT COUNT(*) FROM "commentaires" WHERE "commentaires"."event_id" = $1  [["event_id", 20]]

                    <div class="dropdown pull-right"><%= link_to "afficher", publication_path(pub[(i+1)*(-1)].id), :class=>"btn btn-info" %></div>
                    <p><em>Publication de: </em><a style="color: rgb(250,250,250); font-size: 20px;" href="/users/<%= pub[(i+1)*(-1)].user.id%>"><%= pub[(i+1)*(-1)].user.first_name %></a></p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

                    <hr class="que" href = "#" align="center" width="75%" size="3">
                          <p data-hook="write-comment__label" class="_24h-e">  <li><a href="/publications/<%= pub[(i+1)*(-1)].id%>/commentpub" >Commentaire </a><strong class="a"><%= pub[(i+1)*(-1)].commentpubs.all.count %></strong></li></p>
---
SELECT COUNT(*) FROM "commentpubs" WHERE "commentpubs"."publication_id" = $1  [["publication_id", 10]]