app/controllers/commentpub_controller.rb

SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT COUNT(*) FROM "commentpubs" WHERE "commentpubs"."publication_id" = $1  [["publication_id", 10]]
SELECT "commentpubs".* FROM "commentpubs" WHERE "commentpubs"."publication_id" = $1  [["publication_id", 10]]
---
   def index

    @commentpub = Commentpub.new
      @publication = Publication.find(params[:publication_id])

    @publication_commentpubs_count = @publication.commentpubs.all.count
    @publication_commentpubs = @publication.commentpubs.all

SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
INSERT INTO "commentpubs" ("content", "user_id", "publication_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "tfghtghtgh"], ["user_id", 61], ["publication_id", 10], ["created_at", "2019-09-18 16:05:11.483755"], ["updated_at", "2019-09-18 16:05:11.483755"]]
---
    def create


     user = current_user
    @publication = Publication.find(params[:publication_id])
    @commentpub = @publication.commentpubs.new(content: params[:content])
    @commentpub.user_id = user.id
    @commentpub.publication_id = @publication.id
   if @commentpub.save