app/controllers/static_pages_controller.rb

  def index
    @events = Event.all
    @recrutements = Recrutement.all
    @clubs = Club.all
---
SELECT "events".* FROM "events"
SELECT "recrutements".* FROM "recrutements"
SELECT "clubs".* FROM "clubs"