app/views/commentpub/index.html.erb

                          <li>
                               <% @publication.commentpubs.each do |coms| %>
---
SELECT "commentpubs".* FROM "commentpubs" WHERE "commentpubs"."publication_id" = $1  [["publication_id", 10]]