app/views/commentpub/index.html.erb

                                    <h1>
                                        Page des publications de <%= @publication.user.first_name %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 61], ["LIMIT", 1]]

                                        <i class="uk-icon-user"></i>
                                        <a class="filter-link" data-original-title="Show only articles of <b>Guest</b>" href="#" rel="nofollow">Guest [<%= @publication.commentpubs.count %>]</a>
---
SELECT "commentpubs".* FROM "commentpubs" WHERE "commentpubs"."publication_id" = $1  [["publication_id", 10]]
SELECT COUNT(*) FROM "commentpubs" WHERE "commentpubs"."publication_id" = $1  [["publication_id", 10]]