app/views/layouts/_header.html.erb

                                                    <li>
                                                        <% Club.all.each do |club| %>
---
SELECT "clubs".* FROM "clubs"

                                                        <% end %>
                                                        <%if a == Club.all.count %>
---
SELECT COUNT(*) FROM "clubs"